# 구구단 혼자 만드니까 자료구조 듣습니다아아아이조아
# 2019.12.16 <ver_1>
#----------------------------------------
#  일단 구구단 get 0
for i in range(10):
    k = i+1
    print('--',k,"단",'--')
    for j in range(10):
        print(k,'x',j,'=',k*j)
        # print('---')
        # print(k*j)
   # print('-'*10)
print('--DONE--')
#----------------------------------------
#  일단 구구단 get 1
for i in range(10):
    k = i+1
    print('--',k,"단",'--')
    for j in range(10):
        l = j+1
        print(k,'x',l,'=',k*l)
        # print('---')
        # print(k*j)
   # print('--------')
print('--DONE--')
#----------------------------------------

# 2019.12.18 => 
# 사용자로 부터 입력값을 받을것 
