# 소프트 웨어 교육과 파이썬_ 실습 



## 연습문제1:아파트에서 소음이 가장 심한 층수를 출력하기
'''국립환경과학원에서는 아파트에서 소음이 가장 심한 층수를 구하는 계산식을 발표했습니다. 소음이 가장 심한 층은 0.2467 * 도로와의 거리(m) + 4.159입니다. 다음 소스 코드를 완성하여 소음이 가장 심한 층수가 출력되게 만드세요. 단, 층수를 출력할 때는 소수점 이하 자리는 버립니다(정수로 출력).
도로와의 거리: 12m '''


## 연습문제2: 스킬 공격력 출력하기</font></h2>
'''L이라는 게임에서 '왜곡' 이라는 스킬이 AP * 0.6+ 225의 피해를 줍니다. 
이게임에서 AP(Ability power, 주문력)는 마법능력치를 뜻합니다. 
다음 소스 코드를 완성하여 스킹릐 피해량이 출력되게 만드세요 
AP : 102'''

##  연습문제3: 정수3개를 입력 받고 합계를 출력하시오
"""다음 소스 코드를 완성하여 정수 세개를 입력받고 합계가 출력되게 만드시오      
(입력)  -10, 20, 30"""
